# ViewSolarstudyIsMultidayStudyType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyIsMultidayStudyType Property
ParameterTypeId Class See Also
---
"Multi-day study"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyIsMultidayStudyType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyIsMultidayStudyType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyIsMultidayStudyType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace